Merge pull request #14 from 01laky/feature/v1.0.0-submission
Feature/v1.0.0 submission
